spec/fixtures/express_checkout/payment/details/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&TRANSACTIONID=14R798164A671130B&method=GetTransactionDetails
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 21 Mar 2013 17:41:50 GMT
      Server: 
      - Apache
      Content-Length: 
      - "1207"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: RECEIVEREMAIL=tc_1356938095_biz%40dynosoft%2ecom&RECEIVERID=GCK9DAQBWTUHQ&EMAIL=tcbuyer%40dynosoft%2ecom&PAYERID=TBB6QXVMP4VM2&PAYERSTATUS=verified&COUNTRYCODE=US&SHIPTONAME=Darius%20Wang&SHIPTOSTREET=1%20Main%20St&SHIPTOCITY=San%20Jose&SHIPTOSTATE=CA&SHIPTOCOUNTRYCODE=US&SHIPTOCOUNTRYNAME=United%20States&SHIPTOZIP=95131&ADDRESSOWNER=PayPal&ADDRESSSTATUS=Confirmed&SALESTAX=0%2e00&SUBJECT=Apple%20Products&TIMESTAMP=2013%2d03%2d21T17%3a41%3a51Z&CORRELATIONID=11f5c017d1cee&ACK=Success&VERSION=72%2e0&BUILD=5479129&FIRSTNAME=Darius&LASTNAME=Wang&TRANSACTIONID=16P98762RW356314B&TRANSACTIONTYPE=cart&PAYMENTTYPE=instant&ORDERTIME=2013%2d03%2d21T17%3a36%3a45Z&AMT=2500%2e00&TAXAMT=0%2e00&SHIPPINGAMT=0%2e00&HANDLINGAMT=0%2e00&CURRENCYCODE=USD&PAYMENTSTATUS=Completed&PENDINGREASON=None&REASONCODE=None&PROTECTIONELIGIBILITY=Eligible&PROTECTIONELIGIBILITYTYPE=ItemNotReceivedEligible%2cUnauthorizedPaymentEligible&L_NAME0=MacBook%20Air%2011%27&L_NAME1=MacBook%20Air%2013%27&L_NUMBER0=1&L_NUMBER1=2&L_QTY0=1&L_QTY1=1&L_TAXAMT0=0%2e00&L_TAXAMT1=0%2e00&L_SHIPPINGAMT0=0%2e00&L_SHIPPINGAMT1=0%2e00&L_HANDLINGAMT0=0%2e00&L_HANDLINGAMT1=0%2e00&L_CURRENCYCODE0=USD&L_CURRENCYCODE1=USD&L_AMT0=1150%2e00&L_AMT1=1350%2e00
    http_version: 
  recorded_at: Thu, 21 Mar 2013 17:41:51 GMT
recorded_with: VCR 2.3.0
